EminAtes/NRF24_STM32/NRF24/Core/Src/RF24.cpp
/*
 Copyright (C) 2011 J. Coliz <maniacbug@ymail.com>
 This program is free software; you can redistribute it and/or
 modify it under the terms of the GNU General Public License
 version 2 as published by the Free Software Foundation.
 */

#include "nRF24L01.h"
#include "RF24_config.h"
#include "RF24.h"
extern UART_HandleTypeDef huart1;
/****************************************************************************/

void RF24::csn(GPIO_PinState mode)
{
	HAL_GPIO_WritePin(csn_pin_port, csn_pin, mode);
}

/****************************************************************************/

void RF24::ce(GPIO_PinState level)
{
	HAL_GPIO_WritePin(ce_pin_port, ce_pin, level);
}

/****************************************************************************/

inline void RF24::beginTransaction()
{
	//_SPI.beginTransaction(SPISettings(RF24_SPI_SPEED, MSBFIRST, SPI_MODE0));
	csn(LOW);

}

/****************************************************************************/

inline void RF24::endTransaction()
{

	csn(HIGH);
	//_SPI.endTransaction();
}

/****************************************************************************/

uint8_t RF24::read_register(uint8_t reg, uint8_t* buf, uint8_t len)
{
	uint8_t status;
	uint8_t temp = (R_REGISTER | ( REGISTER_MASK & reg));
	beginTransaction();
	HAL_SPI_TransmitReceive(hspix, &temp, &status, 1, HAL_MAX_DELAY);
	HAL_SPI_Receive(hspix, buf, len, HAL_MAX_DELAY);
	endTransaction();

	return status;
}

/****************************************************************************/

uint8_t RF24::read_register(uint8_t reg)
{
	uint8_t result;
	uint8_t temp = (R_REGISTER | ( REGISTER_MASK & reg));
	beginTransaction();
	HAL_SPI_Transmit(hspix, &temp, 1, HAL_MAX_DELAY);
	HAL_SPI_Receive(hspix, &result, 1, HAL_MAX_DELAY);
	endTransaction();

	return result;
}

/****************************************************************************/

uint8_t RF24::write_register(uint8_t reg, const uint8_t* buf, uint8_t len)
{
	uint8_t status;
	uint8_t temp = (W_REGISTER | ( REGISTER_MASK & reg));
	beginTransaction();
	HAL_SPI_TransmitReceive(hspix, &temp, &status, 1, HAL_MAX_DELAY);
	HAL_SPI_Receive(hspix, (uint8_t *) buf, len, HAL_MAX_DELAY);
	endTransaction();

	return status;
}

/****************************************************************************/

uint8_t RF24::write_register(uint8_t reg, uint8_t value)
{
	uint8_t status;
	uint8_t temp = (W_REGISTER | ( REGISTER_MASK & reg));
#ifdef SERIAL_DEBUG
	char buffer[100];
	sprintf(buffer, PSTR("write_register(%02x,%02x)\r\n"),reg,value);
	HAL_UART_Transmit(&huart1,(uint8_t *)buffer,strlen(buffer),HAL_MAX_DELAY);
#endif
	beginTransaction();
	HAL_SPI_TransmitReceive(hspix, &temp, &status, 1, HAL_MAX_DELAY);
	HAL_SPI_Transmit(hspix, &value, 1, HAL_MAX_DELAY);
	endTransaction();

	return status;
}

/****************************************************************************/

uint8_t RF24::write_payload(const void* buf, uint8_t data_len, uint8_t writeType)
{
	uint8_t status, temp;
	const uint8_t* current = reinterpret_cast<const uint8_t*>(buf);

	data_len = rf24_min(data_len, payload_size);
	uint8_t blank_len = dynamic_payloads_enabled ? 0 : payload_size - data_len;

	//printf("[Writing %u bytes %u blanks]",data_len,blank_len);
#ifdef SERIAL_DEBUG
	char buffer[100];
	sprintf(buffer,"[Writing %u bytes %u blanks]\n",data_len,blank_len);
	HAL_UART_Transmit(&huart1,(uint8_t *)buffer,strlen(buffer),HAL_MAX_DELAY);
#endif
	beginTransaction();
	HAL_SPI_TransmitReceive(hspix, &writeType, &status, 1, HAL_MAX_DELAY);
	HAL_SPI_Transmit(hspix, (uint8_t *) current, data_len, HAL_MAX_DELAY);
	temp = LOW;
	while (blank_len--)
	{
		HAL_SPI_Transmit(hspix, &temp, 1, HAL_MAX_DELAY);
	}
	endTransaction();

	return status;
}

/****************************************************************************/

uint8_t RF24::read_payload(void* buf, uint8_t data_len)
{
	uint8_t status;
	uint8_t* current = reinterpret_cast<uint8_t*>(buf);
	uint8_t temp = R_RX_PAYLOAD;
	if (data_len > payload_size)
		data_len = payload_size;
	uint8_t blank_len = dynamic_payloads_enabled ? 0 : payload_size - data_len;

	//printf("[Reading %u bytes %u blanks]",data_len,blank_len);
#ifdef SERIAL_DEBUG
	char buffer[100];
	sprintf(buffer, "[Reading %u bytes %u blanks]\n",data_len,blank_len);
	HAL_UART_Transmit(&huart1,(uint8_t *)buffer,strlen(buffer),HAL_MAX_DELAY);
#endif
	beginTransaction();
	HAL_SPI_TransmitReceive(hspix, &temp, &status, 1, HAL_MAX_DELAY);
	HAL_SPI_Receive(hspix, current, data_len, HAL_MAX_DELAY);
	temp = HIGH;
	while (blank_len--)
	{
		HAL_SPI_Transmit(hspix, &temp, 1, HAL_MAX_DELAY);
	}
	endTransaction();

	return status;
}

/****************************************************************************/

uint8_t RF24::flush_rx(void)
{
	return spiTrans( FLUSH_RX);
}

/****************************************************************************/

uint8_t RF24::flush_tx(void)
{
	return spiTrans( FLUSH_TX);
}

/****************************************************************************/

uint8_t RF24::spiTrans(uint8_t cmd)
{

	uint8_t status;

	beginTransaction();
	HAL_SPI_TransmitReceive(hspix, &cmd, &status, 1, HAL_MAX_DELAY);
	endTransaction();

	return status;
}

/****************************************************************************/

uint8_t RF24::get_status(void)
{
	return spiTrans(RF24_NOP);
}

/****************************************************************************/
#if !defined (MINIMAL)
void RF24::print_status(uint8_t status)
{
	char buffer[100];
	sprintf(buffer, PSTR("STATUS\t\t = 0x%02x RX_DR=%x TX_DS=%x MAX_RT=%x RX_P_NO=%x TX_FULL=%x\r\n"), status, (status & _BV(RX_DR)) ? 1 : 0, (status & _BV(TX_DS)) ? 1 : 0, (status & _BV(MAX_RT)) ? 1 : 0,
			((status >> RX_P_NO) & 0x07), (status & _BV(TX_FULL)) ? 1 : 0);
	HAL_UART_Transmit(&huart1,(uint8_t *)buffer,strlen(buffer),HAL_MAX_DELAY);
}

/****************************************************************************/

void RF24::print_observe_tx(uint8_t value)
{
	char buffer[100];
	sprintf(buffer, PSTR("OBSERVE_TX=%02x: POLS_CNT=%x ARC_CNT=%x\r\n"), value, (value >> PLOS_CNT) & 0x0F, (value >> ARC_CNT) & 0x0F);
	HAL_UART_Transmit(&huart1,(uint8_t *)buffer,strlen(buffer),HAL_MAX_DELAY);
}

