EminAtes/NRF24_STM32/NRF24/Core/Src/RF24.cpp
	// Then set the data rate to the slowest (and most reliable) speed supported by all
	// hardware.
	setDataRate(RF24_1MBPS);

	// Initialize CRC and request 2-byte (16bit) CRC
	//setCRCLength( RF24_CRC_16 ) ;

	// Disable dynamic payloads, to match dynamic_payloads_enabled setting - Reset value is 0
	toggle_features();
	write_register(FEATURE, 0);
	write_register(DYNPD, 0);
	dynamic_payloads_enabled = false;

	// Reset current status
	// Notice reset and flush is the last thing we do
	write_register(NRF_STATUS, _BV(RX_DR) | _BV(TX_DS) | _BV(MAX_RT));

	// Set up default configuration.  Callers can always change it later.
	// This channel should be universally safe and not bleed over into adjacent
	// spectrum.
	setChannel(76);

	// Flush buffers
	flush_rx();
	flush_tx();

	powerUp(); //Power up by default when begin() is called

	// Enable PTX, do not write CE high so radio will remain in standby I mode ( 130us max to transition to RX or TX instead of 1500us from powerUp )
	// PTX should use only 22uA of power
	write_register(NRF_CONFIG, (read_register(NRF_CONFIG)) & ~_BV(PRIM_RX));

	// if setup is 0 or ff then there was no response from module
	return (setup != 0 && setup != 0xff);
}

/****************************************************************************/

bool RF24::isChipConnected()
{
	uint8_t setup = read_register(SETUP_AW);
	if (setup >= 1 && setup <= 3)
	{
		return true;
	}

	return false;
}

/****************************************************************************/

void RF24::startListening(void)
{
	powerUp();
	write_register(NRF_CONFIG, read_register(NRF_CONFIG) | _BV(PRIM_RX));
	write_register(NRF_STATUS, _BV(RX_DR) | _BV(TX_DS) | _BV(MAX_RT));
	ce(HIGH);
	// Restore the pipe0 adddress, if exists
	if (pipe0_reading_address[0] > 0)
	{
		write_register(RX_ADDR_P0, pipe0_reading_address, addr_width);
	}
	else
	{
		closeReadingPipe(0);
	}

	// Flush buffers
	//flush_rx();
	if (read_register(FEATURE) & _BV(EN_ACK_PAY))
	{
		flush_tx();
	}

	// Go!
	//HAL_DelayHAL_MAX_DELAY;//us
}

/****************************************************************************/
static const uint8_t child_pipe_enable[] PROGMEM = //look here again "PROGMEM"
		{
		ERX_P0, ERX_P1, ERX_P2, ERX_P3, ERX_P4, ERX_P5 };

void RF24::stopListening(void)
{
	ce(LOW);

	HAL_Delay(txDelay); //us

	if (read_register(FEATURE) & _BV(EN_ACK_PAY))
	{
		HAL_Delay(txDelay); //200us
		flush_tx();
	}
	//flush_rx();
	write_register(NRF_CONFIG, (read_register(NRF_CONFIG)) & ~_BV(PRIM_RX));
	write_register(EN_RXADDR, read_register(EN_RXADDR) | _BV(pgm_read_byte(&child_pipe_enable[0]))); // Enable RX on pipe0

	//HAL_DelayHAL_MAX_DELAY;//us

}

/****************************************************************************/

void RF24::powerDown(void)
{
	ce(LOW); // Guarantee CE is low on powerDown
	write_register(NRF_CONFIG, read_register(NRF_CONFIG) & ~_BV(PWR_UP));
}

/****************************************************************************/

//Power up now. Radio will not power down unless instructed by MCU for config changes etc.
void RF24::powerUp(void)
{
	uint8_t cfg = read_register(NRF_CONFIG);

	// if not powered up then power up and wait for the radio to initialize
	if (!(cfg & _BV(PWR_UP)))
	{
		write_register(NRF_CONFIG, cfg | _BV(PWR_UP));

		// For nRF24L01+ to go from power down mode to TX or RX mode it must first pass through stand-by mode.
		// There must be a delay of Tpd2stby (see Table 16.) after the nRF24L01+ leaves power down mode before
		// the CEis set high. - Tpd2stby can be up to 5ms per the 1.0 datasheet
		HAL_Delay(5);
	}
}

/******************************************************************/
#if defined (FAILURE_HANDLING)
void RF24::errNotify()
{
#if defined (SERIAL_DEBUG)
	char buffer[100];
	sprintf(buffer,PSTR("RF24 HARDWARE FAIL: Radio not responding, verify pin connections, wiring, etc.\r\n"));
	HAL_UART_Transmit(&huart1,(uint8_t *)buffer,strlen(buffer),HAL_MAX_DELAY);
#endif
#if defined (FAILURE_HANDLING)
	failureDetected = 1;
#else
	HAL_Delay(5000);
#endif
}
#endif
/******************************************************************/

//Similar to the previous write, clears the interrupt flags
bool RF24::write(const void* buf, uint8_t len, const bool multicast)
{
	//Start Writing
	startFastWrite(buf, len, multicast);

	//Wait until complete or failed
#if defined (FAILURE_HANDLING)
	uint32_t timer = HAL_GetTick();
#endif

	while (!(get_status() & ( _BV(TX_DS) | _BV(MAX_RT))))
	{
#if defined (FAILURE_HANDLING)
		if (HAL_GetTick() - timer > 95)
		{
			errNotify();
#if defined (FAILURE_HANDLING)
			return 0;
#else
			HAL_DelayHAL_MAX_DELAY;
#endif
		}
#endif
	}

	ce(LOW);

	uint8_t status = write_register(NRF_STATUS, _BV(RX_DR) | _BV(TX_DS) | _BV(MAX_RT));

	//Max retries exceeded
	if (status & _BV(MAX_RT))
	{
		flush_tx(); //Only going to be 1 packet int the FIFO at a time using this method, so just flush
		return 0;
	}
	//TX OK 1 or 0
	return 1;
}

bool RF24::write(const void* buf, uint8_t len)
{
	return write(buf, len, 0);
}
/****************************************************************************/

//For general use, the interrupt flags are not important to clear
bool RF24::writeBlocking(const void* buf, uint8_t len, uint32_t timeout)
{
	//Block until the FIFO is NOT full.
	//Keep track of the MAX retries and set auto-retry if seeing failures
	//This way the FIFO will fill up and allow blocking until packets go through
	//The radio will auto-clear everything in the FIFO as long as CE remains high

	uint32_t timer = HAL_GetTick();							  //Get the time that the payload transmission started

	while ((get_status() & (_BV(TX_FULL))))
	{		  //Blocking only if FIFO is full. This will loop and block until TX is successful or timeout

		if (get_status() & _BV(MAX_RT))
		{					  //If MAX Retries have been reached
			reUseTX();										  //Set re-transmit and clear the MAX_RT interrupt flag
			if (HAL_GetTick() - timer > timeout)
			{
				return 0;
			}		  //If this payload has exceeded the user-defined timeout, exit and return 0
		}
#if defined (FAILURE_HANDLING)
		if (HAL_GetTick() - timer > (timeout + 95))
		{
			errNotify();
#if defined (FAILURE_HANDLING)
			return 0;
#endif
		}
#endif

