EminAtes/NRF24_STM32/NRF24/Core/Src/RF24.cpp
	}

	//Start Writing
	startFastWrite(buf, len, 0);								  //Write the payload if a buffer is clear

	return 1;												  //Return 1 to indicate successful transmission
}

/****************************************************************************/

void RF24::reUseTX()
{
	write_register(NRF_STATUS, _BV(MAX_RT));			  //Clear max retry flag
	spiTrans( REUSE_TX_PL);
	ce(LOW);										  //Re-Transfer packet
	ce(HIGH);
}

/****************************************************************************/

bool RF24::writeFast(const void* buf, uint8_t len, const bool multicast)
{
	//Block until the FIFO is NOT full.
	//Keep track of the MAX retries and set auto-retry if seeing failures
	//Return 0 so the user can control the retrys and set a timer or failure counter if required
	//The radio will auto-clear everything in the FIFO as long as CE remains high

#if defined (FAILURE_HANDLING)
	uint32_t timer = HAL_GetTick();
#endif

	while ((get_status() & (_BV(TX_FULL))))
	{			  //Blocking only if FIFO is full. This will loop and block until TX is successful or fail

		if (get_status() & _BV(MAX_RT))
		{
			//reUseTX();										  //Set re-transmit
			write_register(NRF_STATUS, _BV(MAX_RT));			  //Clear max retry flag
			return 0;										  //Return 0. The previous payload has been retransmitted
															  //From the user perspective, if you get a 0, just keep trying to send the same payload
		}
#if defined (FAILURE_HANDLING)
		if (HAL_GetTick() - timer > 95)
		{
			errNotify();
#if defined (FAILURE_HANDLING)
			return 0;
#endif
		}
#endif
	}
	//Start Writing
	startFastWrite(buf, len, multicast);

	return 1;
}

bool RF24::writeFast(const void* buf, uint8_t len)
{
	return writeFast(buf, len, 0);
}

/****************************************************************************/

//Per the documentation, we want to set PTX Mode when not listening. Then all we do is write data and set CE high
//In this mode, if we can keep the FIFO buffers loaded, packets will transmit immediately (no 130us delay)
//Otherwise we enter Standby-II mode, which is still faster than standby mode
//Also, we remove the need to keep writing the config register over and over and delaying for 150 us each time if sending a stream of data
void RF24::startFastWrite(const void* buf, uint8_t len, const bool multicast, bool startTx)
{ //TMRh20

	//write_payload( buf,len);
	write_payload(buf, len, multicast ? W_TX_PAYLOAD_NO_ACK : W_TX_PAYLOAD);
	if (startTx)
	{
		ce(HIGH);
	}

}

/****************************************************************************/

//Added the original startWrite back in so users can still use interrupts, ack payloads, etc
//Allows the library to pass all tests
void RF24::startWrite(const void* buf, uint8_t len, const bool multicast)
{

	// Send the payload

	//write_payload( buf, len );
	write_payload(buf, len, multicast ? W_TX_PAYLOAD_NO_ACK : W_TX_PAYLOAD);
	ce(HIGH);
#if !defined(F_CPU) || F_CPU > 20000000
	HAL_Delay(10); //us
#endif
	ce(LOW);

}

/****************************************************************************/

bool RF24::rxFifoFull()
{
	return read_register(FIFO_STATUS) & _BV(RX_FULL);
}
/****************************************************************************/

bool RF24::txStandBy()
{

#if defined (FAILURE_HANDLING)
	uint32_t timeout = HAL_GetTick();
#endif
	while (!(read_register(FIFO_STATUS) & _BV(TX_EMPTY)))
	{
		if (get_status() & _BV(MAX_RT))
		{
			write_register(NRF_STATUS, _BV(MAX_RT));
			ce(LOW);
			flush_tx();    //Non blocking, flush the data
			return 0;
		}
#if defined (FAILURE_HANDLING)
		if (HAL_GetTick() - timeout > 95)
		{
			errNotify();
#if defined (FAILURE_HANDLING)
			return 0;
#endif
		}
#endif
	}

	ce(LOW);			   //Set STANDBY-I mode
	return 1;
}

/****************************************************************************/

bool RF24::txStandBy(uint32_t timeout, bool startTx)
{

	if (startTx)
	{
		stopListening();
		ce(HIGH);
	}
	uint32_t start = HAL_GetTick();

	while (!(read_register(FIFO_STATUS) & _BV(TX_EMPTY)))
	{
		if (get_status() & _BV(MAX_RT))
		{
			write_register(NRF_STATUS, _BV(MAX_RT));
			ce(LOW);										  //Set re-transmit
			ce(HIGH);
			if (HAL_GetTick() - start >= timeout)
			{
				ce(LOW);
				flush_tx();
				return 0;
			}
		}
#if defined (FAILURE_HANDLING)
		if (HAL_GetTick() - start > (timeout + 95))
		{
			errNotify();
#if defined (FAILURE_HANDLING)
			return 0;
#endif
		}
#endif
	}

	ce(LOW);				   //Set STANDBY-I mode
	return 1;

}

/****************************************************************************/

void RF24::maskIRQ(bool tx, bool fail, bool rx)
{

	uint8_t config = read_register(NRF_CONFIG);
	/* clear the interrupt flags */
	config &= ~(1 << MASK_MAX_RT | 1 << MASK_TX_DS | 1 << MASK_RX_DR);
	/* set the specified interrupt flags */
	config |= fail << MASK_MAX_RT | tx << MASK_TX_DS | rx << MASK_RX_DR;
	write_register(NRF_CONFIG, config);
}

/****************************************************************************/

uint8_t RF24::getDynamicPayloadSize(void)
{
	uint8_t result = 0;
	uint8_t temp = R_RX_PL_WID;
	beginTransaction();
	HAL_SPI_Transmit(hspix, &temp, 1, HAL_MAX_DELAY);
	HAL_SPI_Receive(hspix, &result, 1, HAL_MAX_DELAY);
	endTransaction();

	if (result > 32)
	{
		flush_rx();
		HAL_Delay(100);
		return 0;
	}
	return result;
}

/****************************************************************************/

bool RF24::available(void)
{
	return available(NULL);
}

/****************************************************************************/

bool RF24::available(uint8_t* pipe_num)
{
	if (!(read_register(FIFO_STATUS) & _BV(RX_EMPTY)))
	{

		// If the caller wants the pipe number, include that
		if (pipe_num)
		{
			uint8_t status = get_status();
			*pipe_num = (status >> RX_P_NO) & 0x07;
		}
		return 1;
	}

	return 0;

}

/****************************************************************************/

void RF24::read(void* buf, uint8_t len)
{

	// Fetch the payload
	read_payload(buf, len);

	//Clear the two possible interrupt flags with one command
	write_register(NRF_STATUS, _BV(RX_DR) | _BV(MAX_RT) | _BV(TX_DS));

