EminAtes/NRF24_STM32/NRF24/Core/Src/RF24.cpp
	dynamic_payloads_enabled = false;
}

/****************************************************************************/

void RF24::enableAckPayload(void)
{
	//
	// enable ack payload and dynamic payload features
	//

	//toggle_features();
	write_register(FEATURE, read_register(FEATURE) | _BV(EN_ACK_PAY) | _BV(EN_DPL));

#ifdef SERIAL_DEBUG
	char buffer[100];
	sprintf(buffer, "FEATURE=%i\r\n",read_register(FEATURE));
	HAL_UART_Transmit(&huart1,(uint8_t *)buffer,strlen(buffer),HAL_MAX_DELAY);
#endif

	//
	// Enable dynamic payload on pipes 0 & 1
	//

	write_register(DYNPD, read_register(DYNPD) | _BV(DPL_P1) | _BV(DPL_P0));
	dynamic_payloads_enabled = true;
}

/****************************************************************************/

void RF24::enableDynamicAck(void)
{
	//
	// enable dynamic ack features
	//
	//toggle_features();
	write_register(FEATURE, read_register(FEATURE) | _BV(EN_DYN_ACK));

#ifdef SERIAL_DEBUG
	char buffer[100];
	sprintf(buffer, "FEATURE=%i\r\n",read_register(FEATURE));
	HAL_UART_Transmit(&huart1,(uint8_t *)buffer,strlen(buffer),HAL_MAX_DELAY);
#endif

}

/****************************************************************************/

void RF24::writeAckPayload(uint8_t pipe, const void* buf, uint8_t len)
{
	const uint8_t* current = reinterpret_cast<const uint8_t*>(buf);
	uint8_t temp = (W_ACK_PAYLOAD | (pipe & 0x07));
	uint8_t data_len = rf24_min(len, 32);

	beginTransaction();
	HAL_SPI_Transmit(hspix, &temp, 1, HAL_MAX_DELAY);
	HAL_SPI_Receive(hspix, (uint8_t *) current, data_len, HAL_MAX_DELAY);
	endTransaction();

}

/****************************************************************************/

bool RF24::isAckPayloadAvailable(void)
{
	return !(read_register(FIFO_STATUS) & _BV(RX_EMPTY));
}

/****************************************************************************/

bool RF24::isPVariant(void)
{
	return p_variant;
}

/****************************************************************************/

void RF24::setAutoAck(bool enable)
{
	if (enable)
		write_register(EN_AA, 0x3F);
	else
		write_register(EN_AA, 0);
}

/****************************************************************************/

void RF24::setAutoAck(uint8_t pipe, bool enable)
{
	if (pipe <= 6)
	{
		uint8_t en_aa = read_register( EN_AA);
		if (enable)
		{
			en_aa |= _BV(pipe);
		}
		else
		{
			en_aa &= ~_BV(pipe);
		}
		write_register( EN_AA, en_aa);
	}
}

/****************************************************************************/

bool RF24::testCarrier(void)
{
	return (read_register(CD) & 1);
}

/****************************************************************************/

bool RF24::testRPD(void)
{
	return (read_register(RPD) & 1);
}

/****************************************************************************/

void RF24::setPALevel(uint8_t level)
{

	uint8_t setup = read_register(RF_SETUP) & 0xF8;

	if (level > 3)
	{  						// If invalid level, go to max PA
		level = (RF24_PA_MAX << 1) + 1;		// +1 to support the SI24R1 chip extra bit
	}
	else
	{
		level = (level << 1) + 1;	 		// Else set level as requested
	}

	write_register( RF_SETUP, setup |= level);	// Write it to the chip
}

/****************************************************************************/

uint8_t RF24::getPALevel(void)
{

	return (read_register(RF_SETUP) & (_BV(RF_PWR_LOW) | _BV(RF_PWR_HIGH))) >> 1;
}

/****************************************************************************/

bool RF24::setDataRate(rf24_datarate_e speed)
{
	bool result = false;
	uint8_t setup = read_register(RF_SETUP);

	// HIGH and LOW '00' is 1Mbs - our default
	setup &= ~(_BV(RF_DR_LOW) | _BV(RF_DR_HIGH));

#if !defined(F_CPU) || F_CPU > 20000000
	txDelay = 250;
#else //16Mhz Arduino
	txDelay=85;
#endif
	if (speed == RF24_250KBPS)
	{
		// Must set the RF_DR_LOW to 1; RF_DR_HIGH (used to be RF_DR) is already 0
		// Making it '10'.
		setup |= _BV(RF_DR_LOW);
#if !defined(F_CPU) || F_CPU > 20000000
		txDelay = 450;
#else //16Mhz Arduino
		txDelay=155;
#endif
	}
	else
	{
		// Set 2Mbs, RF_DR (RF_DR_HIGH) is set 1
		// Making it '01'
		if (speed == RF24_2MBPS)
		{
			setup |= _BV(RF_DR_HIGH);
#if !defined(F_CPU) || F_CPU > 20000000
			txDelay = 190;
#else //16Mhz Arduino
			txDelay=65;
#endif
		}
	}
	write_register(RF_SETUP, setup);

	// Verify our result
	if (read_register(RF_SETUP) == setup)
	{
		result = true;
	}
	return result;
}

/****************************************************************************/

rf24_datarate_e RF24::getDataRate(void)
{
	rf24_datarate_e result;
	uint8_t dr = read_register(RF_SETUP) & (_BV(RF_DR_LOW) | _BV(RF_DR_HIGH));

	// switch uses RAM (evil!)
	// Order matters in our case below
	if (dr == _BV(RF_DR_LOW))
	{
		// '10' = 250KBPS
		result = RF24_250KBPS;
	}
	else if (dr == _BV(RF_DR_HIGH))
	{
		// '01' = 2MBPS
		result = RF24_2MBPS;
	}
	else
	{
		// '00' = 1MBPS
		result = RF24_1MBPS;
	}
	return result;
}

/****************************************************************************/

void RF24::setCRCLength(rf24_crclength_e length)
{
	uint8_t config = read_register(NRF_CONFIG) & ~( _BV(CRCO) | _BV(EN_CRC));

	// switch uses RAM (evil!)
	if (length == RF24_CRC_DISABLED)
	{
		// Do nothing, we turned it off above.
	}
	else if (length == RF24_CRC_8)
	{
		config |= _BV(EN_CRC);
	}
	else
	{
		config |= _BV(EN_CRC);
		config |= _BV(CRCO);
	}
	write_register( NRF_CONFIG, config);
}

/****************************************************************************/

rf24_crclength_e RF24::getCRCLength(void)
{
	rf24_crclength_e result = RF24_CRC_DISABLED;

	uint8_t config = read_register(NRF_CONFIG) & ( _BV(CRCO) | _BV(EN_CRC));
	uint8_t AA = read_register(EN_AA);

	if (config & _BV(EN_CRC) || AA)
	{
		if (config & _BV(CRCO))
			result = RF24_CRC_16;
		else
			result = RF24_CRC_8;
	}

	return result;
}

/****************************************************************************/

void RF24::disableCRC(void)
{
	uint8_t disable = read_register(NRF_CONFIG) & ~_BV(EN_CRC);
	write_register( NRF_CONFIG, disable);
}

/****************************************************************************/
void RF24::setRetries(uint8_t delay, uint8_t count)
{
	write_register(SETUP_RETR, (delay & 0xf) << ARD | (count & 0xf) << ARC);
}
